Revit 2027 API
BuiltInFailures.GenericMEPFailures.SplitElementDeletionWarning Property
 The value specified for the Joint Gap exceeds the length of the split segment, so the segment will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SplitElementDeletionWarning { get; }
Public Shared ReadOnly Property SplitElementDeletionWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SplitElementDeletionWarning {
	FailureDefinitionId^ get ();
}
static member SplitElementDeletionWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace